Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
          <instance name="FLEXCOM7">
            <register-group address-space="base" name="FLEXCOM7" name-in-module="FLEXCOM" offset="0x4001C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB4" function="B" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PC13" function="B" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PC21" function="A" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PB3" function="B" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PC12" function="B" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PC20" function="A" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PB2" function="B" group="FLEXCOM7_IO" index="2"/>
              <signal pad="PC15" function="B" group="FLEXCOM7_IO" index="2"/>
              <signal pad="PB1" function="B" group="FLEXCOM7_IO" index="3"/>
              <signal pad="PC14" function="B" group="FLEXCOM7_IO" index="3"/>
              <signal pad="PB2" function="C" group="FLEXCOM7_IO" index="4"/>
              <signal pad="PC11" function="B" group="FLEXCOM7_IO" index="4"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="R">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x40053060"/>
          </instance>
        </module>
        <module name="ICM" id="11105" version="M">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x44010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="57"/>
              <param name="CLOCK_ID" value="57"/>
              <param name="INSTANCE_ID_ICMSEC" value="58"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="6342" version="J">
          <instance name="MATRIX0">
            <register-group address-space="base" name="MATRIX0" name-in-module="MATRIX" offset="0x46004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="60"/>
            </parameters>
          </instance>
          <instance name="MATRIX1">
            <register-group address-space="base" name="MATRIX1" name-in-module="MATRIX" offset="0x40044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="61"/>
            </parameters>
          </instance>
          <instance name="MATRIX2">
            <register-group address-space="base" name="MATRIX2" name-in-module="MATRIX" offset="0x4A000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="94"/>
            </parameters>
          </instance>
          <instance name="MATRIX3">
            <register-group address-space="base" name="MATRIX3" name-in-module="MATRIX" offset="0x48020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="95"/>
            </parameters>
          </instance>
        </module>
        <module name="MEM2MEM" id="11211" version="C">
          <instance name="MEM2MEM0">
            <register-group address-space="base" name="MEM2MEM0" name-in-module="MEM2MEM" offset="0x40034000"/>
            <parameters>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
          <instance name="MEM2MEM1">
            <register-group address-space="base" name="MEM2MEM1" name-in-module="MEM2MEM" offset="0x48004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="78"/>
              <param name="CLOCK_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11264" version="O">
          <instance name="PIO0">
            <register-group address-space="base" name="PIO0" name-in-module="PIO" offset="0x40048000"/>
            <parameters>
              <param name="CLOCK_ID" value="17"/>
            </parameters>
            <signals>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="58" function="default" pad="PB26"/>
              <signal group="P" index="64" function="default" pad="PC0"/>
              <signal group="P" index="66" function="default" pad="PC2"/>
              <signal group="P" index="67" function="default" pad="PC3"/>
              <signal group="P" index="69" function="default" pad="PC5"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
            </signals>
          </instance>
          <instance name="PIOA">
            <parameters>
              <param name="INSTANCE_ID" value="17"/>
              <param name="INSTANCE_ID_SEC" value="18"/>
              <param name="PIO_BASE" value="PIO0"/>
              <param name="PIO_GROUP_INDEX" value="0"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <parameters>
              <param name="INSTANCE_ID" value="19"/>
              <param name="INSTANCE_ID_SEC" value="20"/>
              <param name="PIO_BASE" value="PIO0"/>
              <param name="PIO_GROUP_INDEX" value="1"/>
            </parameters>
          </instance>
