Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
        <register caption="USART Channel Status Register" name="FLEX_US_CSR" offset="0x214" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="LIN_MODE"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" name="RXRDY" modes="DEFAULT"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" name="TXRDY" modes="DEFAULT"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" name="RXBRK" modes="DEFAULT"/>
          <bitfield caption="End of RX Buffer (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)" mask="0x00000008" name="ENDRX" modes="DEFAULT"/>
          <bitfield caption="End of TX Buffer (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)" mask="0x00000010" name="ENDTX" modes="DEFAULT"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE" modes="DEFAULT"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME" modes="DEFAULT"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE" modes="DEFAULT"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" name="TIMEOUT" modes="DEFAULT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" name="TXEMPTY" modes="DEFAULT"/>
          <bitfield caption="Max Number of Repetitions Reached" mask="0x00000400" name="ITER" modes="DEFAULT"/>
          <bitfield caption="TX Buffer Empty (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)" mask="0x00000800" name="TXBUFE" modes="DEFAULT"/>
          <bitfield caption="RX Buffer Full (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)" mask="0x00001000" name="RXBUFF" modes="DEFAULT"/>
          <bitfield caption="Non Acknowledge Interrupt" mask="0x00002000" name="NACK" modes="DEFAULT"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" name="CTSIC" modes="DEFAULT"/>
          <bitfield caption="Comparison Status" mask="0x00400000" name="CMP" modes="DEFAULT"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS" modes="DEFAULT"/>
          <bitfield caption="Manchester Error" mask="0x01000000" name="MANE" modes="DEFAULT"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" name="RXRDY" modes="LIN_MODE"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" name="TXRDY" modes="LIN_MODE"/>
          <bitfield caption="End of RX Buffer (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)" mask="0x00000008" name="ENDRX" modes="LIN_MODE"/>
          <bitfield caption="End of TX Buffer (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)" mask="0x00000010" name="ENDTX" modes="LIN_MODE"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE" modes="LIN_MODE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME" modes="LIN_MODE"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE" modes="LIN_MODE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" name="TIMEOUT" modes="LIN_MODE"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" name="TXEMPTY" modes="LIN_MODE"/>
          <bitfield caption="TX Buffer Empty (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)" mask="0x00000800" name="TXBUFE" modes="LIN_MODE"/>
          <bitfield caption="RX Buffer Full (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)" mask="0x00001000" name="RXBUFF" modes="LIN_MODE"/>
          <bitfield caption="LIN Break Sent or LIN Break Received" mask="0x00002000" name="LINBK" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received" mask="0x00004000" name="LINID" modes="LIN_MODE"/>
          <bitfield caption="LIN Transfer Completed" mask="0x00008000" name="LINTC" modes="LIN_MODE"/>
          <bitfield caption="LIN Bus Line Status" mask="0x00800000" name="LINBLS" modes="LIN_MODE"/>
          <bitfield caption="LIN Bit Error" mask="0x02000000" name="LINBE" modes="LIN_MODE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error" mask="0x04000000" name="LINISFE" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Parity Error" mask="0x08000000" name="LINIPE" modes="LIN_MODE"/>
          <bitfield caption="LIN Checksum Error" mask="0x10000000" name="LINCE" modes="LIN_MODE"/>
          <bitfield caption="LIN Client Not Responding Error" mask="0x20000000" name="LINSNRE" modes="LIN_MODE"/>
          <bitfield caption="LIN Synch Tolerance Error" mask="0x40000000" name="LINSTE" modes="LIN_MODE"/>
          <bitfield caption="LIN Header Timeout Error" mask="0x80000000" name="LINHTE" modes="LIN_MODE"/>
        </register>
        <register caption="USART Receive Holding Register" name="FLEX_US_RHR" offset="0x218" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR" modes="DEFAULT"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH" modes="DEFAULT"/>
          <bitfield caption="Received Characters" mask="0x000000FF" name="RXCHR0" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Characters" mask="0x0000FF00" name="RXCHR1" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Characters" mask="0x00FF0000" name="RXCHR2" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Characters" mask="0xFF000000" name="RXCHR3" modes="FIFO_MULTI_DATA"/>
        </register>
        <register caption="USART Transmit Holding Register" name="FLEX_US_THR" offset="0x21C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR" modes="DEFAULT"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH" modes="DEFAULT"/>
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR0" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0x0000FF00" name="TXCHR1" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0x00FF0000" name="TXCHR2" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0xFF000000" name="TXCHR3" modes="FIFO_MULTI_DATA"/>
        </register>
