Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
      <value-group caption="Default Master Type" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module caption="Memory to Memory" name="MEM2MEM" id="11211" version="C">
      <register-group name="MEM2MEM">
        <register caption="Transfer Holding Register" name="MEM2MEM_THR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Transfer Holding Data" mask="0xFFFFFFFF" name="THDATA"/>
        </register>
        <register caption="Mode Register" name="MEM2MEM_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Transfer Size" mask="0x00000003" name="TSIZE" values="MEM2MEM_MR__TSIZE"/>
        </register>
        <register caption="Interrupt Enable Register" name="MEM2MEM_IER" offset="0x08" rw="W" size="4">
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="MEM2MEM_IDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="End of Transfer Interrupt Disable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="MEM2MEM_IMR" offset="0x10" rw="R" size="4">
          <bitfield caption="End of Transfer Interrupt Mask" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Mask" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="MEM2MEM_ISR" offset="0x14" rw="R" size="4">
          <bitfield caption="End of Transfer" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Write Protection Mode Register" name="MEM2MEM_WPMR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MEM2MEM_WPMR__WPKEY"/>
        </register>
        <register caption="Receive Pointer Register" name="MEM2MEM_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="MEM2MEM_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="MEM2MEM_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="MEM2MEM_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="MEM2MEM_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="MEM2MEM_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="MEM2MEM_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="MEM2MEM_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="MEM2MEM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
