Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event Interrupt Mask" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus Interrupt Mask" mask="0x00000004" name="EOTPKB"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared on read)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event (cleared on read)" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus (cleared on read)" mask="0x00000004" name="EOTPKB"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="TRNG_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="First Error Report Enable" mask="0x00000010" name="FIRSTE"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TRNG_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TRNG_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Write Protection Violation Source (cleared on read)" mask="0x00FFFF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="TRNG_WPSR__SWETYP"/>
          <bitfield caption="Software Error Class (cleared on read)" mask="0x80000000" name="ECLASS" values="TRNG_WPSR__ECLASS"/>
        </register>
      </register-group>
      <value-group caption="Register Write Access Key" name="TRNG_CR__WAKEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524E47"/>
      </value-group>
      <value-group caption="Half Rate Enable" name="TRNG_MR__HALFR">
        <value caption="Maximum stream rate provided (1 sample every 84 MCK clock cycles)." name="DISABLED" value="0"/>
        <value caption="Half maximum stream rate provided if the peripheral clock frequency is above 100 MHz (1 sample every 168 MCK clock cycles)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Key Bus Client" name="TRNG_PKBCR__KSLAVE">
        <value caption="AES" name="AES_ID" value="0"/>
        <value caption="AESB" name="AESB_ID" value="1"/>
      </value-group>
      <value-group caption="Register Write Access Key" name="TRNG_PKBCR__WAKEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524B"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TRNG_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0." name="PASSWD" value="0x524E47"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="TRNG_WPSR__SWETYP">
        <value caption="TRNG is enabled and a write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="TRNG is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address." name="UNDEF_RW" value="0x2"/>
        <value caption="The TRNG_ODATA register was read when TRNG was disabled or TRNG used for private key bus transfer (Error)." name="TRNG_DIS" value="0x3"/>
        <value caption="A write access to TRNG_PKBCR has been attempted during a private key bus transfer (Error)." name="PKB_BUSY" value="0x4"/>
      </value-group>
      <value-group caption="Software Error Class (cleared on read)" name="TRNG_WPSR__ECLASS">
        <value caption="An abnormal access that does not affect system functionality." name="WARNING" value="0"/>
        <value caption="Reading TRNG_ODATA when TRNG was disabled or TRNG used for private key bus transfer. TRNG does not provide a random value. Writing to TRNG_PKBCR while a private key bus transfer is ongoing does not launch a new private key bus transfer." name="ERROR" value="1"/>
      </value-group>
    </module>
    <module name="FUSES" id="1" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="GPNVM Bits" name="GPNVMBITS" offset="0x0" rw="RW" size="2">
          <bitfield caption="Security Bit" mask="0x00000001" name="SECURITY_BIT" rw="R"/>
          <bitfield caption="Memory Plane Selection" mask="0x00000002" name="PLANE_SELECTION"/>
          <bitfield caption="Hardware Erase Function Lock" mask="0x0000001C" name="ERASE_FUNCTION_LOCK"/>
          <bitfield caption="Boot Mode Selection" mask="0x000001E0" name="BOOT_MODE"/>
        </register>
      </register-group>
    </module>
    <module name="LOCKBIT" id="1" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits Word 0" name="LOCKBIT_WORD0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
          <bitfield caption="Lock Region 16" mask="0x00010000" name="LOCK_REGION_16"/>
          <bitfield caption="Lock Region 17" mask="0x00020000" name="LOCK_REGION_17"/>
          <bitfield caption="Lock Region 18" mask="0x00040000" name="LOCK_REGION_18"/>
          <bitfield caption="Lock Region 19" mask="0x00080000" name="LOCK_REGION_19"/>
          <bitfield caption="Lock Region 20" mask="0x00100000" name="LOCK_REGION_20"/>
          <bitfield caption="Lock Region 21" mask="0x00200000" name="LOCK_REGION_21"/>
          <bitfield caption="Lock Region 22" mask="0x00400000" name="LOCK_REGION_22"/>
          <bitfield caption="Lock Region 23" mask="0x00800000" name="LOCK_REGION_23"/>
          <bitfield caption="Lock Region 24" mask="0x01000000" name="LOCK_REGION_24"/>
          <bitfield caption="Lock Region 25" mask="0x02000000" name="LOCK_REGION_25"/>
          <bitfield caption="Lock Region 26" mask="0x04000000" name="LOCK_REGION_26"/>
          <bitfield caption="Lock Region 27" mask="0x08000000" name="LOCK_REGION_27"/>
          <bitfield caption="Lock Region 28" mask="0x10000000" name="LOCK_REGION_28"/>
          <bitfield caption="Lock Region 29" mask="0x20000000" name="LOCK_REGION_29"/>
          <bitfield caption="Lock Region 30" mask="0x40000000" name="LOCK_REGION_30"/>
          <bitfield caption="Lock Region 31" mask="0x80000000" name="LOCK_REGION_31"/>
        </register>
