Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
        <register caption="Lock Bits Word 9" name="LOCKBIT_WORD9" offset="0x24" rw="RW" size="4">
          <bitfield caption="Lock Region 288" mask="0x00000001" name="LOCK_REGION_288"/>
          <bitfield caption="Lock Region 289" mask="0x00000002" name="LOCK_REGION_289"/>
          <bitfield caption="Lock Region 290" mask="0x00000004" name="LOCK_REGION_290"/>
          <bitfield caption="Lock Region 291" mask="0x00000008" name="LOCK_REGION_291"/>
          <bitfield caption="Lock Region 292" mask="0x00000010" name="LOCK_REGION_292"/>
          <bitfield caption="Lock Region 293" mask="0x00000020" name="LOCK_REGION_293"/>
          <bitfield caption="Lock Region 294" mask="0x00000040" name="LOCK_REGION_294"/>
          <bitfield caption="Lock Region 295" mask="0x00000080" name="LOCK_REGION_295"/>
          <bitfield caption="Lock Region 296" mask="0x00000100" name="LOCK_REGION_296"/>
          <bitfield caption="Lock Region 297" mask="0x00000200" name="LOCK_REGION_297"/>
          <bitfield caption="Lock Region 298" mask="0x00000400" name="LOCK_REGION_298"/>
          <bitfield caption="Lock Region 299" mask="0x00000800" name="LOCK_REGION_299"/>
          <bitfield caption="Lock Region 300" mask="0x00001000" name="LOCK_REGION_300"/>
          <bitfield caption="Lock Region 301" mask="0x00002000" name="LOCK_REGION_301"/>
          <bitfield caption="Lock Region 302" mask="0x00004000" name="LOCK_REGION_302"/>
          <bitfield caption="Lock Region 303" mask="0x00008000" name="LOCK_REGION_303"/>
          <bitfield caption="Lock Region 304" mask="0x00010000" name="LOCK_REGION_304"/>
          <bitfield caption="Lock Region 305" mask="0x00020000" name="LOCK_REGION_305"/>
          <bitfield caption="Lock Region 306" mask="0x00040000" name="LOCK_REGION_306"/>
          <bitfield caption="Lock Region 307" mask="0x00080000" name="LOCK_REGION_307"/>
          <bitfield caption="Lock Region 308" mask="0x00100000" name="LOCK_REGION_308"/>
          <bitfield caption="Lock Region 309" mask="0x00200000" name="LOCK_REGION_309"/>
          <bitfield caption="Lock Region 310" mask="0x00400000" name="LOCK_REGION_310"/>
          <bitfield caption="Lock Region 311" mask="0x00800000" name="LOCK_REGION_311"/>
          <bitfield caption="Lock Region 312" mask="0x01000000" name="LOCK_REGION_312"/>
          <bitfield caption="Lock Region 313" mask="0x02000000" name="LOCK_REGION_313"/>
          <bitfield caption="Lock Region 314" mask="0x04000000" name="LOCK_REGION_314"/>
          <bitfield caption="Lock Region 315" mask="0x08000000" name="LOCK_REGION_315"/>
          <bitfield caption="Lock Region 316" mask="0x10000000" name="LOCK_REGION_316"/>
          <bitfield caption="Lock Region 317" mask="0x20000000" name="LOCK_REGION_317"/>
          <bitfield caption="Lock Region 318" mask="0x40000000" name="LOCK_REGION_318"/>
          <bitfield caption="Lock Region 319" mask="0x80000000" name="LOCK_REGION_319"/>
        </register>
        <register caption="Lock Bits Word 10" name="LOCKBIT_WORD10" offset="0x28" rw="RW" size="4">
          <bitfield caption="Lock Region 320" mask="0x00000001" name="LOCK_REGION_320"/>
          <bitfield caption="Lock Region 321" mask="0x00000002" name="LOCK_REGION_321"/>
          <bitfield caption="Lock Region 322" mask="0x00000004" name="LOCK_REGION_322"/>
          <bitfield caption="Lock Region 323" mask="0x00000008" name="LOCK_REGION_323"/>
          <bitfield caption="Lock Region 324" mask="0x00000010" name="LOCK_REGION_324"/>
          <bitfield caption="Lock Region 325" mask="0x00000020" name="LOCK_REGION_325"/>
          <bitfield caption="Lock Region 326" mask="0x00000040" name="LOCK_REGION_326"/>
          <bitfield caption="Lock Region 327" mask="0x00000080" name="LOCK_REGION_327"/>
          <bitfield caption="Lock Region 328" mask="0x00000100" name="LOCK_REGION_328"/>
          <bitfield caption="Lock Region 329" mask="0x00000200" name="LOCK_REGION_329"/>
          <bitfield caption="Lock Region 330" mask="0x00000400" name="LOCK_REGION_330"/>
          <bitfield caption="Lock Region 331" mask="0x00000800" name="LOCK_REGION_331"/>
          <bitfield caption="Lock Region 332" mask="0x00001000" name="LOCK_REGION_332"/>
          <bitfield caption="Lock Region 333" mask="0x00002000" name="LOCK_REGION_333"/>
          <bitfield caption="Lock Region 334" mask="0x00004000" name="LOCK_REGION_334"/>
          <bitfield caption="Lock Region 335" mask="0x00008000" name="LOCK_REGION_335"/>
          <bitfield caption="Lock Region 336" mask="0x00010000" name="LOCK_REGION_336"/>
          <bitfield caption="Lock Region 337" mask="0x00020000" name="LOCK_REGION_337"/>
          <bitfield caption="Lock Region 338" mask="0x00040000" name="LOCK_REGION_338"/>
          <bitfield caption="Lock Region 339" mask="0x00080000" name="LOCK_REGION_339"/>
          <bitfield caption="Lock Region 340" mask="0x00100000" name="LOCK_REGION_340"/>
          <bitfield caption="Lock Region 341" mask="0x00200000" name="LOCK_REGION_341"/>
          <bitfield caption="Lock Region 342" mask="0x00400000" name="LOCK_REGION_342"/>
          <bitfield caption="Lock Region 343" mask="0x00800000" name="LOCK_REGION_343"/>
          <bitfield caption="Lock Region 344" mask="0x01000000" name="LOCK_REGION_344"/>
          <bitfield caption="Lock Region 345" mask="0x02000000" name="LOCK_REGION_345"/>
          <bitfield caption="Lock Region 346" mask="0x04000000" name="LOCK_REGION_346"/>
          <bitfield caption="Lock Region 347" mask="0x08000000" name="LOCK_REGION_347"/>
          <bitfield caption="Lock Region 348" mask="0x10000000" name="LOCK_REGION_348"/>
          <bitfield caption="Lock Region 349" mask="0x20000000" name="LOCK_REGION_349"/>
          <bitfield caption="Lock Region 350" mask="0x40000000" name="LOCK_REGION_350"/>
          <bitfield caption="Lock Region 351" mask="0x80000000" name="LOCK_REGION_351"/>
        </register>
        <register caption="Lock Bits Word 11" name="LOCKBIT_WORD11" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Lock Region 352" mask="0x00000001" name="LOCK_REGION_352"/>
          <bitfield caption="Lock Region 353" mask="0x00000002" name="LOCK_REGION_353"/>
          <bitfield caption="Lock Region 354" mask="0x00000004" name="LOCK_REGION_354"/>
          <bitfield caption="Lock Region 355" mask="0x00000008" name="LOCK_REGION_355"/>
          <bitfield caption="Lock Region 356" mask="0x00000010" name="LOCK_REGION_356"/>
          <bitfield caption="Lock Region 357" mask="0x00000020" name="LOCK_REGION_357"/>
          <bitfield caption="Lock Region 358" mask="0x00000040" name="LOCK_REGION_358"/>
          <bitfield caption="Lock Region 359" mask="0x00000080" name="LOCK_REGION_359"/>
          <bitfield caption="Lock Region 360" mask="0x00000100" name="LOCK_REGION_360"/>
          <bitfield caption="Lock Region 361" mask="0x00000200" name="LOCK_REGION_361"/>
          <bitfield caption="Lock Region 362" mask="0x00000400" name="LOCK_REGION_362"/>
          <bitfield caption="Lock Region 363" mask="0x00000800" name="LOCK_REGION_363"/>
          <bitfield caption="Lock Region 364" mask="0x00001000" name="LOCK_REGION_364"/>
          <bitfield caption="Lock Region 365" mask="0x00002000" name="LOCK_REGION_365"/>
          <bitfield caption="Lock Region 366" mask="0x00004000" name="LOCK_REGION_366"/>
          <bitfield caption="Lock Region 367" mask="0x00008000" name="LOCK_REGION_367"/>
          <bitfield caption="Lock Region 368" mask="0x00010000" name="LOCK_REGION_368"/>
          <bitfield caption="Lock Region 369" mask="0x00020000" name="LOCK_REGION_369"/>
          <bitfield caption="Lock Region 370" mask="0x00040000" name="LOCK_REGION_370"/>
          <bitfield caption="Lock Region 371" mask="0x00080000" name="LOCK_REGION_371"/>
          <bitfield caption="Lock Region 372" mask="0x00100000" name="LOCK_REGION_372"/>
          <bitfield caption="Lock Region 373" mask="0x00200000" name="LOCK_REGION_373"/>
          <bitfield caption="Lock Region 374" mask="0x00400000" name="LOCK_REGION_374"/>
          <bitfield caption="Lock Region 375" mask="0x00800000" name="LOCK_REGION_375"/>
          <bitfield caption="Lock Region 376" mask="0x01000000" name="LOCK_REGION_376"/>
          <bitfield caption="Lock Region 377" mask="0x02000000" name="LOCK_REGION_377"/>
          <bitfield caption="Lock Region 378" mask="0x04000000" name="LOCK_REGION_378"/>
          <bitfield caption="Lock Region 379" mask="0x08000000" name="LOCK_REGION_379"/>
          <bitfield caption="Lock Region 380" mask="0x10000000" name="LOCK_REGION_380"/>
          <bitfield caption="Lock Region 381" mask="0x20000000" name="LOCK_REGION_381"/>
          <bitfield caption="Lock Region 382" mask="0x40000000" name="LOCK_REGION_382"/>
          <bitfield caption="Lock Region 383" mask="0x80000000" name="LOCK_REGION_383"/>
        </register>
