Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG64.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFN64">
      <pin position="13" pad="PA4"/>
      <pin position="14" pad="PA5"/>
      <pin position="15" pad="PA6"/>
      <pin position="16" pad="PA7"/>
      <pin position="7" pad="PA8"/>
      <pin position="8" pad="PA9"/>
      <pin position="17" pad="PA12"/>
      <pin position="18" pad="PA13"/>
      <pin position="34" pad="PA23"/>
      <pin position="35" pad="PA24"/>
      <pin position="36" pad="PA25"/>
      <pin position="37" pad="PA29"/>
      <pin position="39" pad="PB0"/>
      <pin position="40" pad="PB2"/>
      <pin position="43" pad="PB3"/>
      <pin position="44" pad="PB4"/>
      <pin position="45" pad="PB9"/>
      <pin position="46" pad="PB10"/>
      <pin position="47" pad="PB11"/>
      <pin position="48" pad="PB12"/>
      <pin position="49" pad="PB24"/>
      <pin position="50" pad="PB25"/>
      <pin position="51" pad="PB26"/>
      <pin position="52" pad="PC0"/>
      <pin position="55" pad="PC2"/>
      <pin position="56" pad="PC3"/>
      <pin position="57" pad="PC5"/>
      <pin position="59" pad="PC10"/>
      <pin position="60" pad="PC11"/>
      <pin position="62" pad="PC12"/>
      <pin position="63" pad="PC13"/>
      <pin position="64" pad="PC14"/>
      <pin position="1" pad="PC15"/>
      <pin position="2" pad="PC18"/>
      <pin position="3" pad="PC19"/>
      <pin position="4" pad="PC20"/>
      <pin position="5" pad="PC21"/>
      <pin position="6" pad="PC22"/>
      <pin position="10" pad="PD17"/>
      <pin position="11" pad="PD18"/>
      <pin position="12" pad="PD19"/>
      <pin position="22" pad="NRST"/>
      <pin position="28" pad="FWUP"/>
      <pin position="29" pad="JTAGSEL"/>
      <pin position="33" pad="SHDN"/>
      <pin position="32" pad="TST"/>
      <pin position="27" pad="RTCOUT0"/>
      <pin position="26" pad="WKUP2_TMP2"/>
      <pin position="31" pad="XOUT32"/>
      <pin position="30" pad="XIN32"/>
      <pin position="9" pad="VDD3V3"/>
      <pin position="25" pad="VBAT"/>
      <pin position="24" pad="VDD3V3"/>
      <pin position="42" pad="VDD3V3"/>
      <pin position="54" pad="VDD3V3"/>
      <pin position="61" pad="VDD3V3"/>
      <pin position="19" pad="VDDCORE"/>
      <pin position="23" pad="VDDCORE"/>
      <pin position="53" pad="VDDCORE"/>
      <pin position="58" pad="VDDCORE"/>
      <pin position="41" pad="VDDPLL"/>
      <pin position="20" pad="VDDOUT"/>
      <pin position="21" pad="VDD3V3"/>
      <pin position="38" pad="VREFP"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
